In [3]:
import pandas as pd
import numpy as np

In [2]:
sr =pd.Series([1,2,3,4,5,6,7,8])

In [4]:
sr1=pd.Series(np.array([1,2,3,4,5,6,7,8]))

In [6]:
type(sr.values), type(sr1.values)

(numpy.ndarray, numpy.ndarray)

In [7]:
sr

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [10]:
sr.head(7)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [11]:
sr.tail(7)

1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [12]:
sr.size

8

In [13]:
sr.min()

np.int64(1)

In [14]:
sr.max()

np.int64(8)

In [15]:
sr.sum()

np.int64(36)

In [17]:
sr.describe()

count    8.00000
mean     4.50000
std      2.44949
min      1.00000
25%      2.75000
50%      4.50000
75%      6.25000
max      8.00000
dtype: float64

In [18]:
sr.index

RangeIndex(start=0, stop=8, step=1)

In [22]:
data = pd.Series({'a':1,'b':2,'c':3,'d':4},name="alok")

In [23]:
data

a    1
b    2
c    3
d    4
Name: alok, dtype: int64

In [21]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [24]:
data.name

'alok'

In [25]:
student_dict = {
 'name':['peter','saint','noeum','parle','samme','dave'],
 'iq':[100,90,120,80,13,90],
 'marks':[80,70,100,50,11,80],
 'package':[10,7,14,2,15,100]
}

In [26]:
df=pd.DataFrame(student_dict)
df

    name   iq  marks  package
0  peter  100     80       10
1  saint   90     70        7
2  noeum  120    100       14
3  parle   80     50        2
4  samme   13     11       15
5   dave   90     80      100

In [27]:
df.head()

    name   iq  marks  package
0  peter  100     80       10
1  saint   90     70        7
2  noeum  120    100       14
3  parle   80     50        2
4  samme   13     11       15

In [28]:
df.tail()

    name   iq  marks  package
1  saint   90     70        7
2  noeum  120    100       14
3  parle   80     50        2
4  samme   13     11       15
5   dave   90     80      100

In [29]:
df.describe()

               iq       marks     package
count    6.000000    6.000000    6.000000
mean    82.166667   65.166667   24.666667
std     36.498858   31.115377   37.211109
min     13.000000   11.000000    2.000000
25%     82.500000   55.000000    7.750000
50%     90.000000   75.000000   12.000000
75%     97.500000   80.000000   14.750000
max    120.000000  100.000000  100.000000

In [30]:
df.value_counts()

name   iq   marks  package
dave   90   80     100        1
noeum  120  100    14         1
parle  80   50     2          1
peter  100  80     10         1
saint  90   70     7          1
samme  13   11     15         1
Name: count, dtype: int64

In [32]:
df.isna().sum()

name       0
iq         0
marks      0
package    0
dtype: int64

In [33]:
df= pd.read_csv(r'D:\PreGrad\AL_ML\Session_1\imdb_movies.csv')

In [34]:
df.head()

,names,date_x,score,genre,overview,crew,orig_title,status,orig_lang,budget_x,revenue,country
0,Creed III,03/02/2023,73.0,"Drama, Action","After dominating the boxing world, Adonis Cree...","Michael B. Jordan, Adonis Creed, Tessa Thompso...",Creed III,Released,English,75000000.0,2.716167e+08,AU
1,Avatar: The Way of Water,12/15/2022,78.0,"Science Fiction, Adventure, Action",Set more than a decade after the events of the...,"Sam Worthington, Jake Sully, Zoe Saldaña, Neyt...",Avatar: The Way of Water,Released,English,460000000.0,2.316795e+09,AU
2,The Super Mario Bros. Movie,04/05/2023,76.0,"Animation, Adventure, Family, Fantasy, Comedy","While working underground to fix a water main,...","Chris Pratt, Mario (voice), Anya Taylor-Joy, P...",The Super Mario Bros. Movie,Released,English,100000000.0,7.244590e+08,AU
3,Mummies,01/05/2023,70.0,"Animation, Comedy, Family, Adventure, Fantasy","Through a series of unfortunate events, three ...","Óscar Barberán, Thut (voice), Ana Esther Albor...",Momias,Released,"Spanish, Castilian",12300000.0,3.420000e+07,AU
4,Supercell,03/17/2023,61.0,Action,Good-hearted teenager William always lived in ...,"Skeet Ulrich, Roy Cameron, Anne Heche, Dr Quin...",Supercell,Released,English,77000000.0,3.409420e+08,US

In [35]:
df.count()

names         10178
date_x        10178
score         10178
genre         10093
overview      10178
crew          10122
orig_title    10178
status        10178
orig_lang     10178
budget_x      10178
revenue       10178
country       10178
dtype: int64

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10178 entries, 0 to 10177
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   names       10178 non-null  object
 1   date_x      10178 non-null  object
 2   score       10178 non-null  float64
 3   genre       10093 non-null  object
 4   overview    10178 non-null  object
 5   crew        10122 non-null  object
 6   orig_title  10178 non-null  object
 7   status      10178 non-null  object
 8   orig_lang   10178 non-null  object
 9   budget_x    10178 non-null  float64
 10  revenue     10178 non-null  float64
 11  country     10178 non-null  object
dtypes: float64(3), object(9)
memory usage: 954.3+ KB

In [38]:
df.columns

Index(['names', 'date_x', 'score', 'genre', 'overview', 'crew', 'orig_title',
       'status', 'orig_lang', 'budget_x', 'revenue', 'country'],
      dtype='object')

In [41]:
df.isna().sum()

names          0
date_x         0
score          0
genre         85
overview       0
crew          56
orig_title     0
status         0
orig_lang      0
budget_x       0
revenue        0
country        0
dtype: int64

In [45]:
df['country'].value_counts()

country
AU    4885
US    2750
JP     538
KR     361
FR     222
GB     174
ES     153
HK     125
IT     123
MX     105
CN      93
DE      88
CA      67
RU      52
PH      43
IN      43
AR      41
BR      38
TH      30
DK      24
PL      22
TR      20
NL      16
NO      16
CO      14
TW      13
ID      12
IE      11
SE       9
CL       9
BE       7
PE       7
GR       6
FI       6
SU       5
CH       5
UA       4
SG       4
ZA       3
HU       3
VN       3
IS       2
GT       2
PR       2
AT       2
UY       2
CZ       2
SK       2
IR       2
MY       2
DO       1
IL       1
BY       1
BO       1
MU       1
PY       1
LV       1
XC       1
PT       1
KH       1
Name: count, dtype: int64

In [47]:
df.isnull().sum()

names          0
date_x         0
score          0
genre         85
overview       0
crew          56
orig_title     0
status         0
orig_lang      0
budget_x       0
revenue        0
country        0
dtype: int64

       Unnamed: 0                                              Twits label
52205       52205        هاي باهي وليت تفهم في اللبسة متاع الرجال 🤔🤔   neu
52206       52206                                      ريي يصبر امها   neu
52207       52207            اللهم امين يارب العالمين ربي يصبر أهلهم   pos
52208       52208  اللهم امين يارب العالمين مخيبها عواشر لا حول و...   pos
52209       52209  لا حول ولا قوة الا بالله جريمة بشعة في wangen ...   neg